from movie import Movie
from genre import Genre


movies = [
    Movie(
        'Бойцовский клуб',
        Genre.THRILLER,
        '''
Сотрудник страховой компании страдает хронической бессонницей и отчаянно пытается вырваться из мучительно скучной жизни.
Однажды в очередной командировке он встречает некоего Тайлера Дёрдена — харизматического торговца мылом с извращенной философией.
Тайлер уверен, что самосовершенствование — удел слабых, а единственное, ради чего стоит жить, — саморазрушение.
        ''',
        1999,
        'https://avatars.mds.yandex.net/get-kinopoisk-image/4716873/85b585ea-410f-4d1c-aaa5-8d242756c2a4/600x900',
        8.7,
        63000000,
    ),
    Movie(
        'Крестный отец',
        Genre.DRAMA,
        '''
Эпическая история о криминальной семье Корлеоне, которая борется за власть и честь в мире мафии.
История охватывает десятилетия, показывая борьбу за выживание и влияние.
        ''',
        1972,
        'https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/c11652e8-653b-47c1-8e72-1552399a775b/600x900',
        9.2,
        6000000,
    ),
    Movie(
        'Назад в будущее',
        Genre.COMEDY,
        '''
Молодой парень Марти МакФлай случайно отправляется в прошлое на машине времени, созданной эксцентричным ученым.
Теперь ему предстоит исправить историю и вернуться в свое время.
        ''',
        1985,
        'https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/73cf2ed0-fd52-47a2-9e26-74104360786a/600x900',
        8.5,
        19000000,
    ),
    Movie(
        'Интерстеллар',
        Genre.THRILLER,
        '''
Когда Земля становится непригодной для жизни, группа астронавтов отправляется за пределы галактики
в поисках нового дома для человечества.
        ''',
        2014,
        'https://avatars.mds.yandex.net/get-kinopoisk-image/1600647/430042eb-ee69-4818-aed0-a312400a26bf/600x900',
        8.6,
        165000000,
    ),
    Movie(
        'Побег из Шоушенка',
        Genre.DRAMA,
        '''
История Энди Дюфрейна, несправедливо осужденного за убийство своей жены и попавшего в тюрьму Шоушенк.
Его вера и дружба с другим заключенным меняют жизни вокруг.
        ''',
        1994,
        'https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/0b76b2a2-d1c7-4f04-a284-80ff7bb709a4/600x900',
        9.3,
        25000000,
    ),
    Movie(
        'Темный рыцарь',
        Genre.THRILLER,
        '''
Бэтмен сталкивается с новым опасным врагом — Джокером, который сеет хаос и разрушения в Готэме.
Герою предстоит сделать тяжелый выбор ради спасения города.
        ''',
        2008,
        'https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/0fa5bf50-d5ad-446f-a599-b26d070c8b99/600x900',
        9.0,
        185000000,
    ),
    Movie(
        'Форрест Гамп',
        Genre.DRAMA,
        '''
Форрест Гамп — человек с необычным взглядом на мир, который становится свидетелем и участником
многих исторических событий, оставаясь верным своей любви к Дженни.
        ''',
        1994,
        'https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/3560b757-9b95-45ec-af8c-623972370f9d/600x900',
        8.8,
        55000000,
    ),
    Movie(
        'Один дома',
        Genre.COMEDY,
        '''
Маленький Кевин остается один дома на Рождество, случайно забытый семьей.
Он должен защитить дом от двух неуклюжих грабителей.
        ''',
        1990,
        'https://avatars.mds.yandex.net/get-kinopoisk-image/6201401/022a58e3-5b9b-411b-bfb3-09fedb700401/600x900',
        7.7,
        18000000,
    ),
    Movie(
        'Начало',
        Genre.THRILLER,
        '''
Кобб — мастер проникновения в сознание через сны. Он получает задание внедрить идею в подсознание человека,
что становится его самым опасным испытанием.
        ''',
        2010,
        'https://avatars.mds.yandex.net/get-kinopoisk-image/1629390/8ab9a119-dd74-44f0-baec-0629797483d7/600x900',
        8.8,
        160000000,
    ),
    Movie(
        'Амели',
        Genre.COMEDY,
        '''
Амели — мечтательная девушка из Парижа, которая решает изменить жизнь окружающих,
внося в нее радость и магию, оставаясь при этом в тени.
        ''',
        2001,
        'https://avatars.mds.yandex.net/get-kinopoisk-image/6201401/a49739d0-a2da-4e53-83c0-116fe2d4cc27/600x900',
        8.3,
        10000000,
    ),
]